#region 계획
//■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
// 0. 공격 시스템 바꾸기
// 1. 마스터리 만들기
// 2. 액티브 스킬 만들기 (스킬트리)
// 3. 패시브 스킬 만들기 (공격속도, 회전속도, 투사체속도 나누기) 
// 4. 재화 시스템 만들기
// 5. 스탯 시스템 만들기
// 6. UI 수정하기
//■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
#endregion

// 뱀파이어 서바이벌 류의 게임

#region ■■■■■■■■■ 스토리 ■■■■■■■■■
//■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
#region 스토리 전체 개요
// 발레이샤(마족, 지나치지 않은 선) 중 한 가문의 딸을 건드린 로카니안(인간, 지나치지 않은 악)의 한 기사에 대한 이야기.
// 인간은 인간세계에 놀러나온 그녀를 납치하여, 애원하는 그녀를 강간하고 잔인하게 장난삼아 죽임.
// 이를 알게 된 가문의 가주가 그 인간을 납치하여, 그 인간을 끊임없이 수하들과 싸우게 하며 그와 관련된 자들을 눈앞에서 하나하나 모조리 죽이며 복수하는 이야기.
#endregion

#region 스토리 전개
// 어느날 (어떤 마을 / ##)의 한 기사가 (어딘가 / ##)로 잡혀옴.
// (가주 / ##)는 그에게 뜬금없이 "너는 이제 <제리코의 기사>다" 라고 말한 뒤, (어딘가 / ##)에 가둬놓고 양질의 식사와 휴식을 제공하며 계속 수하들과 싸우게 함.
// ( 특정 라운드 / ##)마다 가주가 나타나서 할만하냐며 비웃고 기사는 덤벼들지만 개쳐발림
#endregion

#region 엔딩
// 이후 ( 몇십년 / ##)이 지나 엔딩씬에서 제리코의기사는 가주를 극도로 증오하며 도대체 자신에게 왜 이러냐고 질문함
// 가주는 자신에게 극도의 선한 성향의 딸이 있었는데, 그 딸은 인간계를 너무나 동경하여 어느날 인간계로 놀러갔다가 (어떤 마을 / ##) 기사들을 만났다고 함.
// 딸은 너무 어려서 아직 미성숙한 상태이기에 그 힘이 매우 약해서, 인간 성인 남성보다 조금 강한 정도였는데 그 기사들은 자신에게 친절했던 그녀를 데리고 자신의 아지트로 가서 고문, 강간 등 온갖 말로 표현할 수 없는 행위를 함.
// 그녀는 반항하였지만 기사들 여럿을 상대로 아무것도 할 수 없었고, 결국 온갖 약물과 고문에 의해 온몸이 망가져서 죽음.
// 기사들은 자신들이 저지른 짓을 누군가에게 들키지 않기 위해 그녀의 시체를 불로 태웠는데, 그녀의 마력이 재에 섞여 날아가며 그녀를 샅샅이 뒤지던 가주의 수하들에 의해 발견되어 가주에게 알려지게 됨.
// (가주는 인간을 좋아하는 딸 때문에 인간들을 죽이거나 하지 말고 몰래 수색하라고 명령한 상태)
// 어마어마하게 열받은 가주는 그 주동자들을 색출해냈는데, 그 중 그 일을 주도했던 기사가 바로 "제리코의 기사".
// 그를 잡아서 죽지도 살지도 못하게 만들며 영원한 고통을 주기로 다짐한 가주는 그를 잡아들여서 지금까지 했던 일들을 하였고,

// 여기서 제리코의 기사는 몇십년 전, 자신들이 장난삼아 죽였던 한 인외종의 여자가 자신이 제리코라고 말했던 것이 기억나며 엔딩.
#endregion

//■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
#endregion

#region ■■■■■■■■■ 마스터리 ■■■■■■■■■
//■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
// 처음 던전 들어가기 전에 선택
// 강화계 방출계 변화계 조작계 구현화계 특질계

#region □□□□□□□□□ 기본 마스터리 □□□□□□□□
//---------------------------------------------------------------------------
#region 도검 계열
#endregion

#region 창
#endregion

#region 단검
#endregion

#region 마법 계열
#endregion
//---------------------------------------------------------------------------
#endregion

#region [미구현] □□□□□□□□□ 특수 마스터리 □□□□□□□□
//---------------------------------------------------------------------------
// ex) 빙결계, 화염계, 암흑계 이런 느낌으로?
// 마법은 일반 마법에서 볼 수 없었던 중력마법 이런 느낌?
// 무기는 혈귀술 이런거?
//---------------------------------------------------------------------------
#endregion

//■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
#endregion

#region ■■■■■■■■■ 재화 시스템 ■■■■■■■■■
//■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
#region □□□□□□□□□ 노력의 결정 □□□□□□□□
//---------------------------------------------------------------------------
// 획득방법: 게임 플레이 시간에 따라 획득 / 매 판마다 일정 수치 획득
// 사용처 : 스킬 구매(강력한스킬, 조합스킬)
//---------------------------------------------------------------------------
#endregion

#region □□□□□□□□□ 경험의 결정 □□□□□□□□
//---------------------------------------------------------------------------
// 획득방법 : 몬스터 처치에 따라 획득
// 사용처 : 스킬 구매(기본스킬)
//---------------------------------------------------------------------------
#endregion

#region □□□□□□□□□ 재능의 결정 □□□□□□□□
//---------------------------------------------------------------------------
// 획득방법 : 랜덤하게 몬스터를 잡거나 게임시간이 지나면서 획득
// 사용처 : 스킬 구매(조합스킬)
//---------------------------------------------------------------------------
#endregion

#region □□□□□□□□□ 의 결정 □□□□□□□□
//---------------------------------------------------------------------------
// 획득방법 : 
// 사용처 : 
//---------------------------------------------------------------------------
#endregion

#region □□□□□□□□□ 의 결정 □□□□□□□□
//---------------------------------------------------------------------------
// 획득방법 : 
// 사용처 : 
//---------------------------------------------------------------------------
#endregion

#region □□□□□□□□□ 의 결정 □□□□□□□□
//---------------------------------------------------------------------------
// 획득방법 : 
// 사용처 : 
//---------------------------------------------------------------------------
#endregion
//■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
#endregion

#region ■■■■■■■■■ 던전 시스템 ■■■■■■■■■
//■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
#region 일반 던전
// [미구현] 스테이지는 하나의 "던전"을 들어가서 클리어하는 것으로 진행
// [미구현] 던전 한 개에는 등장하는 몬스터의 수가 정해져 있음
// [미구현] 킬 수 절반일 때 중간보스가 등장
// [미구현] 킬 수 다 채우면 보스가 등장
#endregion

#region 특수 던전
// 스탯에 제한을 두지는 않을 것임. 그러면 아마 한 쪽으로 치중된 스탯투자가 나타날 것이다.
// 이로 인해 생기는 문제점들을 방지하는, 반드시 돌아야만 할 수 밖에 없는 보상을 주는 특수던전을 만들어야 함.
// ex) 내 체력이 50% 이하일 때만 공격이 들어가는 보스 (공격력 무한 캐릭 방지)

// 엔드컨텐츠로, "던전 브레이크가 걸린 던전"을 들어갈 수 있음
// 이 던전은 깨고 나서, 던전 브레이크가 열려서 쏟아져 나오는 몬스터들을 한 번 더 잡아야 클리어됨
// 그만큼 보상도 좋게 생성 예정
#endregion
//■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
#endregion

#region ■■■■■■■■■ 스킬 시스템 ■■■■■■■■■
//■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
// [미구현] 하나의 기본스킬을 정하면 그 쪽 스킬트리를 보여주며 쭉 개방
// [미구현] 스킬창에서 그 스킬을 누르면 그 스킬만 쭉 나가도록 설정 (쿠나이 누르면 쿠나이만 던짐, 칼 누르면 칼만 돌림)
// [미구현] 스킬창이 뜰 때, 패시브와 액티브 스킬을 선택하도록 설정

#region 액티브 스킬
//---------------------------------------------------------------------------
#region 기본 스킬

#region 물리 무기 스킬
//===========================================================================
//===========================================================================
#endregion

#region 마법 스킬
//===========================================================================
//===========================================================================
#endregion

#endregion

#region 1차 스킬

#region 물리 무기 스킬
//===========================================================================
//===========================================================================
#endregion

#region 마법 스킬
//===========================================================================
//===========================================================================
#endregion

#endregion

#region 2차 스킬

#region 물리 무기 스킬
//===========================================================================
//===========================================================================
#endregion

#region 마법 스킬
//===========================================================================
//===========================================================================
#endregion

#endregion

#region 3차 스킬

#region 물리 무기 스킬
//===========================================================================
//===========================================================================
#endregion

#region 마법 스킬
//===========================================================================
//===========================================================================
#endregion

#endregion

// << 조합 스킬들 >>
// 조건 : 특정 스킬들 #레벨 이상 , 노력의 결정 , 경험의 결정, 재능의 결정
// 더블, 트리플, 쿼드러플, 퀸터플, 섹터플, 셉터플스킬

//---------------------------------------------------------------------------
#endregion

#region 패시브 스킬
//---------------------------------------------------------------------------
#region 이동 속도 증가
// 이동 속도 x 1.2
#endregion

#region 받는 피해량 감소
#endregion

#region 치명타 확률 증가
#endregion

#region 치명타 피해량 증가
#endregion

#region 스킬 쿨타임 감소
// 스킬 쿨타임 15% 감소 ~ x 0.85 ( 4번 하면 쿨타임 50% 감소 )
#endregion

#region 투사체 크기 증가 // 인스펙터의 Scale로 조절
// 투사체 크기 x 1.3 ( 3번 하면 크기 2.19배)
#endregion

#region 다중 투사체 보조
// 투사체 개수 +1
#endregion

#region 관통 보조
#endregion
//---------------------------------------------------------------------------
#endregion

#region 고유 스킬
// 캐릭터마다 고유 스킬을 갖고 있음
// 고유 스킬의 능력들은 특정 스탯이 충족되면 해금? or 특정 스탯을 희생하는 방식? 여하튼 초반부터 고유스킬로 몹을 쓸어담는 일은 없도록 만들어야 할 것
#endregion
//■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
#endregion

#region ■■■■■■■■■ 게임 진행 방향 예상 ■■■■■■■■■
//■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
// [던전 내부]
// 던전을 진행하며 노력의 결정을 획득

// [던전 외부]
// 1. 스탯 향상 + 장비 획득
// 2. 높은 등급 장비획득하면, 장비 강화 시작
// 3. 장비 강화 마무리 되어가면 유물 획득 시작
// 4. 유물 획득하면 강화 시작
// 최종 : 지속적인 스탯 향상, 장비 강화 및 유물 강화
//■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
#endregion

#region ■■■■■■■■■ 스탯 시스템 ■■■■■■■■■
//■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
// [미구현] 
// [미구현] 
// [미구현] 

// [미구현] 강화 확률을 올려주는 스탯은 오직 경험치로만 올릴 수 있음 / 스탯 초기화 시, 이 경험치는 돌려받지 못함 / 요구 경험치량이 매우 높아서, 후반부에나 찍을 수 있음

// [미구현] 스탯 리셋에는 스탯 수치에 따라 특정 재화 A가 필요

#region 스탯 종류
// 힘
// 
// 
#endregion
//■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
#endregion

#region ■■■■■■■■■ 장비 시스템 ■■■■■■■■■
//■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
// [미구현] 보스를 잡게 되면 무기, 방어구, 장신구를 랜덤한 희귀도로 드랍
// [미구현] 중복드랍된 장비 처리 : 어떡할지 아직 미정임

// [미구현] 특정 재화(파편)를 이용하여 무기 강화 가능 (스탯처럼 영구적으로 적용됨)
// [미구현] 강화 실패 시, 스택이 쌓임. 이 스택이 한계치에 도달하면 확정적으로 강화성공 (로스트아크의 장기백 같은 느낌)
// [미구현] 의 파편 : 장비를 확률적으로 더 높은 등급으로 만듦
// [미구현] 의 파편 : 장비의 기본 능력치를 확률적으로 상승시킴
// [미구현] 의 파편 : 장비의 특성 옵션을 확정적으로 리롤
// [미구현] 의 파편 : 장비의 특성 옵션 능력치를 확률적으로 상승시킴
//■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
#endregion

#region ■■■■■■■■■ 유물 시스템 ■■■■■■■■■
//■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
// [미구현] 
// [미구현] 
// [미구현] 
// [미구현] 
// [미구현] 
// [미구현] 
// [미구현] 
// [미구현] 
//■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
#endregion







#region ■■■■■■■■■  ■■■■■■■■■
//■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
// [미구현] 
// [미구현] 
// [미구현] 
// [미구현] 
// [미구현] 
// [미구현] 
// [미구현] 
// [미구현] 
//■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
#endregion

#region ■■■■■■■■■  ■■■■■■■■■
//■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
// [미구현] 
// [미구현] 
// [미구현] 
// [미구현] 
// [미구현] 
// [미구현] 
// [미구현] 
// [미구현] 
//■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
#endregion

#region ■■■■■■■■■  ■■■■■■■■■
//■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
// [미구현] 
// [미구현] 
// [미구현] 
// [미구현] 
// [미구현] 
// [미구현] 
// [미구현] 
// [미구현] 
//■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
#endregion

#region ■■■■■■■■■  ■■■■■■■■■
//■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
// [미구현] 
// [미구현] 
// [미구현] 
// [미구현] 
// [미구현] 
// [미구현] 
// [미구현] 
// [미구현] 
//■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
#endregion